In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

titanic_df = pd.read_csv('./titanic.csv')

In [3]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [89]:
# titanic_df[titanic_df["Age"] > 18].sum()
titanic_dt1 = titanic_df[titanic_df["Age"] > 18]
total_under18 = len(titanic_dt1)
survived_dt1 = titanic_dt1.sum().Survived
prob1 = survived_dt1 / total_under18

display("{:.3%} percent of those over 18 survived".format(prob1))

'38.261% percent of those over 18 survived'

In [91]:
titanic_dt2 = titanic_df[(titanic_df["Pclass"] == 1)]
total_class1 = len(titanic_dt2)
survived_dt2 = titanic_dt2.sum().Survived
prob2 = survived_dt2 / total_class1

display("{:.3%} percent of those in first class survived".format(prob2))

'62.963% percent of those in first class survived'

In [102]:
titanic_dt3 = titanic_df[(titanic_df["Sex"] == "male") & (titanic_df["Age"] > 65)]
total_males_above65 = len(titanic_dt3)
survived_dt3 = len(titanic_dt3[titanic_dt3["Survived"] == 1])
prob3 = survived_dt3 / total_males_above65

display("{:.3%} percent of those above 65 and male survived".format(prob3))

'12.500% percent of those above 65 and male survived'